Tekla Open API Reference for Tekla Structures 2025
Filter.CreateFile Method
 Creates a filter and saves it as a text file.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string CreateFile(
	FilterExpressionFileType FilterExpressionFileType,
	string FullFileName
)
Public Function CreateFile (
	FilterExpressionFileType As FilterExpressionFileType,
	FullFileName As String
) As String
Parameters
FilterExpressionFileType
Type: Tekla.Structures.Filtering.FilterExpressionFileType
The FilterExpressionFileType to be generated.
FullFileName
Type: System.String
The full file name of the file to be saved.
Return Value
Type: String
A string containing the filter's full file name.
See Also
Reference
Filter Class
Tekla.Structures.Filtering Namespace